cf/Documents/СписаниеДепонентовВДоходыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СписаниеДепонентовВДоходыОрганизаций</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСДепонентамиОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыплатаДепонентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ВзаиморасчетыСДепонентамиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСДепонентамиОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/СписаниеДепонентовВДоходыОрганизаций/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Выполняет автоматическое заполнение документа 
// 
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  нет
//
Процедура Автозаполнение(ОтборПоРаботникам = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Физлица",			ОтборПоРаботникам);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Приход",				ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Дата",				Дата);
	Запрос.УстановитьПараметр("ДатаИсковойДавности",ДобавитьМесяц(Дата,-36));
	
	ОтборПоРаботникамТекст = ?(ОтборПоРаботникам = Неопределено,"","");//"И Физлицо В (&Физлица)"
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НеВыплаченныеДепоненты.Физлицо,
	|	НеВыплаченныеДепоненты.Ведомость,
	|	НеВыплаченныеДепоненты.Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Физлицо КАК Физлицо,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Ведомость КАК Ведомость,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Организация КАК Организация,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.СуммаОстаток КАК Сумма
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Остатки(
	|			&Дата,
	|			Организация = &Организация
	|				" + ОтборПоРаботникамТекст + ") КАК ВзаиморасчетыСДепонентамиОрганизацийОстатки
	|	ГДЕ
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.СуммаОстаток > 0) КАК НеВыплаченныеДепоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций КАК ВзаиморасчетыСДепонентамиОрганизаций
	|		ПО НеВыплаченныеДепоненты.Физлицо = ВзаиморасчетыСДепонентамиОрганизаций.Физлицо
	|			И НеВыплаченныеДепоненты.Ведомость = ВзаиморасчетыСДепонентамиОрганизаций.Ведомость
	|			И НеВыплаченныеДепоненты.Организация = ВзаиморасчетыСДепонентамиОрганизаций.Организация
	|			И (ВзаиморасчетыСДепонентамиОрганизаций.ВидДвижения = &Приход)
	|			И (ВзаиморасчетыСДепонентамиОрганизаций.Период < &ДатаИсковойДавности)";
	
	ВыплатаДепонентов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры //  Автозаполнение


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписаниеДепонентовВДоходыОрганизаций.Дата,
	|	СписаниеДепонентовВДоходыОрганизаций.Ссылка,
	|	СписаниеДепонентовВДоходыОрганизаций.Организация,
	|	СписаниеДепонентовВДоходыОрганизаций.СчетДоходов
	|ИЗ
	|	Документ.СписаниеДепонентовВДоходыОрганизаций КАК СписаниеДепонентовВДоходыОрганизаций
	|ГДЕ
	|	СписаниеДепонентовВДоходыОрганизаций.Ссылка = &ДокументСсылка";

	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по табличной части документам
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоВыплатаДепонентов(ВыборкаПоШапкеДокумента)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("Дата",				Дата);
	Запрос.УстановитьПараметр("Организация",		Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.НомерСтроки,
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ведомость,
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ведомость.Номер КАК Номер,
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ведомость.Дата КАК Дата,
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.ФизЛицо,
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Сумма,
	|	МИНИМУМ(ДвойныеСтроки.НомерСтроки) КАК НомерПовторяющейсяСтроки,
	|	ЕСТЬNULL(ВзаиморасчетыСДепонентамиОрганизацийОстатки.СуммаОстаток, 0) КАК ОстатокДепонента
	|ИЗ
	|	Документ.СписаниеДепонентовВДоходыОрганизаций.ВыплатаДепонентов КАК СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеДепонентовВДоходыОрганизаций.ВыплатаДепонентов КАК ДвойныеСтроки
	|		ПО СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ссылка = ДвойныеСтроки.Ссылка
	|			И СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.ФизЛицо = ДвойныеСтроки.ФизЛицо
	|			И СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ведомость = ДвойныеСтроки.Ведомость
	|			И СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.НомерСтроки < ДвойныеСтроки.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Остатки(
	|		&Дата,
	|		Организация = &Организация
	|		    И Физлицо В
	|		        (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		            СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.ФизЛицо
	|		        ИЗ
	|		            Документ.СписаниеДепонентовВДоходыОрганизаций.ВыплатаДепонентов КАК СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов
	|		        ГДЕ
	|		            СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ссылка = &ДокументСсылка)) КАК ВзаиморасчетыСДепонентамиОрганизацийОстатки
	|		ПО СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.ФизЛицо = ВзаиморасчетыСДепонентамиОрганизацийОстатки.Физлицо
	|			И СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ведомость = ВзаиморасчетыСДепонентамиОрганизацийОстатки.Ведомость
	|ГДЕ
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.НомерСтроки,
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Ведомость,
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.ФизЛицо,
	|	СписаниеДепонентовВДоходыОрганизацийВыплатаДепонентов.Сумма,
	|	ВзаиморасчетыСДепонентамиОрганизацийОстатки.СуммаОстаток";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоДепонированиеЗаработнойПлаты()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 		 - флаг отказа в проведении,
//	Заголовок	 - Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.СчетДоходов) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указан счет учета доходов организации!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строки документа.
Процедура ПроверитьЗаполнениеСтрокиВыплатаДепонентов(ВыборкаПоВыплатаДепонентов, Отказ, Заголовок, ФормироватьПроводкиСводно)

	НачалоСообщения = "В строке № """+ СокрЛП(ВыборкаПоВыплатаДепонентов.НомерСтроки) +
										""" табл. части: ";
	
    ЕстьФизЛицо = ЗначениеЗаполнено(ВыборкаПоВыплатаДепонентов.ФизЛицо);
    ЕстьВедомость = ЗначениеЗаполнено(ВыборкаПоВыплатаДепонентов.Ведомость);

	Если Не ЕстьФизЛицо И Не ФормироватьПроводкиСводно Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НачалоСообщения + "не указан работник!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЕстьВедомость Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НачалоСообщения + "не указана платежная ведомость!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ЕстьВедомость И ЕстьФизЛицо Тогда
		Если ВыборкаПоВыплатаДепонентов.НомерПовторяющейсяСтроки <> Null Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(НачалоСообщения + "обнаружена строка № " + ВыборкаПоВыплатаДепонентов.НомерПовторяющейсяСтроки + ", в которой указан тот же депонент!", Отказ, Заголовок);
		ИначеЕсли ВыборкаПоВыплатаДепонентов.ОстатокДепонента < ВыборкаПоВыплатаДепонентов.Сумма Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(НачалоСообщения + "не выданный остаток депонента (" + Формат(ВыборкаПоВыплатаДепонентов.ОстатокДепонента,"ЧДЦ=2") + ") меньше суммы, указанной в документе!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиДепонированиеЗаработнойПлаты()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ)
	
	Если ВыборкаПоТЧ.Сумма <> 0 Тогда
		
		Движение = Движения.ВзаиморасчетыСДепонентамиОрганизаций.Добавить();
		
		// Свойства
		Движение.Период      = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		// Измерения
		Движение.Организация = ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо     = ВыборкаПоТЧ.ФизЛицо;
		Движение.Ведомость   = ВыборкаПоТЧ.Ведомость;
		
		// Ресурсы
		Движение.Сумма		 = ВыборкаПоТЧ.Сумма;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуПроводки(СтруктураШапкиДокумента,ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, РазвернутымиПроводками = Истина) 
	
	Если ВыборкаПоТЧ.Сумма <> 0 Тогда
		Проводка = Движения.Хозрасчетный.Добавить();
		
		Проводка.Период      = ВыборкаПоШапкеДокумента.Дата;
		Проводка.Организация = ВыборкаПоШапкеДокумента.Организация;
		Проводка.Сумма       = ВыборкаПоТЧ.Сумма;
		
		Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.РасчетыПоДепонированнымСуммам;
		Если РазвернутымиПроводками Тогда
			Проводка.СубконтоДт.РаботникиОрганизаций = ВыборкаПоТЧ.ФизЛицо;
		КонецЕсли;
		
		Проводка.Содержание  = "Списание депонента по ведомости №" + ВыборкаПоТЧ.Номер + " от " + ВыборкаПоТЧ.Дата + " в связи с истечением срока исковой давности";
		Проводка.СчетКт		 = ВыборкаПоШапкеДокумента.СчетДоходов;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Субконто1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Субконто2);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Субконто3);
		
		БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтруктураШапкиДокумента.ПодразделениеОрганизации, СтруктураШапкиДокумента.ПодразделениеОрганизации);
				
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуПроводки

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = ВыплатаДепонентов.Итог("Сумма");

	// заполним КраткийСоставДокумента для обеспечения возможности отбора по физлицу
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ВыплатаДепонентов,, "Физлицо");
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Перем СтруктураШапкиДокумента;
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ФормироватьНалоговыеПроводки = Не НалоговыйУчетУСН.ПрименениеУСН(Организация, Дата);
	ФормироватьПроводкиСводно = (ПланыСчетов.Хозрасчетный.РасчетыПоДепонированнымСуммам.ВидыСубконто.Найти(
		ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций, "ВидСубконто") = Неопределено);
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда
			
			// получим реквизиты табличной части
			РезультатЗапроса = СформироватьЗапросПоВыплатаДепонентов(ВыборкаПоШапкеДокумента);
			ВыборкаПоВыплатаДепонентов = РезультатЗапроса.Выбрать();
			Пока ВыборкаПоВыплатаДепонентов.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиВыплатаДепонентов(ВыборкаПоВыплатаДепонентов, Отказ, Заголовок, ФормироватьПроводкиСводно);
				
				Если Не Отказ и Не ФормироватьПроводкиСводно Тогда
					
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоВыплатаДепонентов);
					
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли; 
		Если НЕ Отказ Тогда
			ТаблицаРезультата = РезультатЗапроса.Выгрузить();
			Если ФормироватьПроводкиСводно Тогда
				ТаблицаРезультата.Свернуть("Номер,Дата","Сумма");
			КонецЕсли;
			Для каждого СтрокаТЗ Из ТаблицаРезультата Цикл
				ДобавитьСтрокуПроводки(СтруктураШапкиДокумента,ВыборкаПоШапкеДокумента, СтрокаТЗ, Не ФормироватьПроводкиСводно);
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, ложь);

КонецПроцедуры
